[
  {
    "name": "Slate",
    "description": "Slate is a simple, MERN (MongoDB, Express, React, Node.js) application for creating, reading, updating, and deleting notes. It provides a minimal interface for productivity and easy note management. This project features CRUD operations for notes, accessed via a custom-built API.",
    "stack": ["HTML", "CSS", "JavaScript", "React.js", "Node.js", "Express.js", "MongoDB"],
    "source": "https://github.com/kdx-08/Slate"
  },
  {
    "name": "TradeBox",
    "description": "A simple backend application built with Express.js and MongoDB, designed for managing items. Data is stored securely in the cloud using MongoDB Atlas. This project features CRUD operations (Create, Read, Update, Delete) for items, accessed via a custom API.",
    "stack": ["HTML", "CSS", "JavaScript", "Node.js", "Express.js", "MongoDB"],
    "source": "https://github.com/kdx-08/TradeBox"
  },
  {
    "name": "Portfolio",
    "description": "The website you are currently on! This is a static website built with React, focused on clean design and simplicity. It uses React components to organize content efficiently and provide a smooth user experience.",
    "stack": ["HTML", "CSS", "JavaScript", "React.js"],
    "source": "https://github.com/kdx-08/Portfolio"
  },
  {
    "name": "Anime Search App",
    "description": "An interactive web app that allows users to search for anime series, movies, and more using the Jikan API. You can enter your favorite anime titles, explore different anime, and see their ratings, images, and more!",
    "stack": ["HTML", "CSS", "JavaScript", "Jikan API"],
    "source": "https://github.com/kdx-08/Anime-Search"
  },
  {
    "name": "Ping Pong Score Keeper",
    "description": "A simple and interactive Ping Pong scorekeeping web app built with HTML, CSS, and JavaScript. This tool allows two players to keep track of their scores up to a chosen target and provides a visual indicator of the winner.",
    "stack": ["HTML", "CSS", "JavaScript"],
    "source": "https://github.com/kdx-08/ScoreKeeper"
  }
]
